yicheng55/MSP430F55xx_uscib1_spi/MX25R1035Fdriver.c
/*Software Driver

SST25VF020B 2 Mbit Serial Flash Memory

March 8, 2010, Rev. 1.0

ABOUT THE SOFTWARE
This application note provides software driver examples for SST25VF020B,
Serial Flash. Extensive comments are included in each routine to describe 
the function of each routine.  The interface coding uses polling method 
rather than the SPI protocol to interface with these serial devices.  The
functions are differentiated below in terms of the communication protocols
(uses Mode 0) and specific device operation instructions. This code has been 
designed to compile using the Keil compiler.


ABOUT THE SST25VF020B

Companion product datasheets for the SST25VF020B should be reviewed in 
conjunction with this application note for a complete understanding 
of the device.


Device Communication Protocol(pinout related) functions:

Functions                    		Function
------------------------------------------------------------------
init					Initializes clock to set up mode 0.
Send_Byte				Sends one byte using SI pin to send and 
					shift out 1-bit per clock rising edge
Get_Byte				Receives one byte using SO pin to receive and shift 
					in 1-bit per clock falling edge
Poll_SO					Used in the polling for RY/BY# of SO during AAI programming
CE_High					Sets Chip Enable pin of the serial flash to high
CE_Low					Clears Chip Enable of the serial flash to low
Hold_Low				Clears Hold pin to make serial flash hold
Unhold					Unholds the serial flash
WP_Low					Clears WP pin to make serial flash write protected
UnWP					Disables write protection pin

Note:  The pin names of the SST25VF020B are used in this application note. The associated test code
will not compile unless these pinouts (SCK, SI, SO, SO, CE, WP, Hold) are pre-defined on your
software which should reflect your hardware interfaced. 	 


Device Operation Instruction functions:

Functions                    		Function
------------------------------------------------------------------
Read_Status_Register			Reads the status register of the serial flash
Read_Status_Register1			Reads the status register1 of the serial flash
EWSR					Enables the Write Status Register
WRSR					Performs a write to the Status Register or Status Register 1
WREN					Write enables the serial flash
WRDI					Write disables the serial flash
EBSY					Enable SO to output RY/BY# status during AAI programming
DBSY					Disable SO to output RY/BY# status during AAI programming
Read_ID					Reads the manufacturer ID and device ID
Jedec_ID_Read				Reads the Jedec ID
Read					Reads one byte from the serial flash and returns byte(max of 33 MHz CLK frequency)
Read_Cont				Reads multiple bytes(max of 33 MHz CLK frequency)
HighSpeed_Read				Reads one byte from the serial flash and returns byte(max of 80 MHz CLK frequency)
HighSpeed_Read_Cont			Reads multiple bytes(max of 80 MHz CLK frequency)
Byte_Program				Program one byte to the serial flash
Auto_Add_IncA				Initial Auto Address Increment process
Auto_Add_IncB				Successive Auto_Address_Increment process after AAI initiation
Auto_Add_IncA_EBSY			Initial Auto Address Increment process with EBSY
Auto_Add_IncB_EBSY			Successive Auto_Address_Increment process after AAI initiation with EBSY
Chip_Erase				Erases entire serial flash
Sector_Erase				Erases one sector (4 KB) of the serial flash
Block_Erase_32K				Erases 32 KByte block memory of the serial flash
Block_Erase_64K				Erases 64 KByte block memory of the serial flash
Wait_Busy				Polls status register until busy bit is low
Wait_Busy_AAI				Polls status register until busy bit is low for AAI programming
WREN_Check				Checks to see if WEL is set
WREN_AAI_Check				Checks to see if WEL and AAI mode is set

*/

                                                                     
//"C" LANGUAGE DRIVERS 

/********************************************************************/
/* Copyright Silicon Storage Technology, Inc. (SST), 1994-2010	    */
/* Example "C" language Driver of SST25VF020B Serial Flash	    */
/* Hardik Patel, Silicon Storage Technology, Inc.                  */
/*                                                                  */
/* Revision 1.0, March 8, 2010			  	    */   
/*                                                                  */
/*								    */
/********************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <msp430.h>



#define SCLK BIT3 	//P4.3 master Clock out
#define SOMI BIT2 	//P4.2 master in
#define SIMO BIT1 	//P4.1 master out
#define CE   BIT0 	//P4.0 Chip Enable line

//#define READ 0x03 // READ instruction
//#define WRITE 0x02 // WRITE instruction
//#define WREN 0x06 // WRITE ENABLE instruction
//#define RDSR 0x05 // READ STATUS register instruction
//#define WRSR 0x01 // WRITE STATUS REGISTER instruction
//#define NOPROT 0x00 // disable all write protections

//unsigned char status_register=0x00;



/* Function Prototypes */

void init();
void SST_Init();
void Send_Byte(unsigned char out);
unsigned char Get_Byte();
void Poll_SO();
void CE_High();
void CE_Low();
void Hold_Low();
void Unhold();
void WP_Low();
void UnWP();
unsigned char Read_Status_Register();
unsigned char Read_Status_Register1();
void EWSR();
void WRSR(unsigned long word, unsigned char byteOrword);
void WREN();
void WRDI();
void EBSY();
void DBSY();
unsigned int Read_ID(unsigned char ID_addr);
unsigned char Read_RES();
unsigned long Jedec_ID_Read(); 
unsigned char Read(unsigned long Dst);
void Read_Cont(unsigned long Dst, unsigned long no_bytes);
unsigned char HighSpeed_Read(unsigned long Dst); 
void HighSpeed_Read_Cont(unsigned long Dst, unsigned long no_bytes);
void Byte_Program(unsigned long Dst, unsigned char byte);
void Auto_Add_IncA(unsigned long Dst, unsigned char byte1, unsigned char byte2);
void Auto_Add_IncB(unsigned char byte1, unsigned char byte2);
void Auto_Add_IncA_EBSY(unsigned long Dst, unsigned char byte1, unsigned char byte2);
void Auto_Add_IncB_EBSY(unsigned char byte1, unsigned char byte2);
void Chip_Erase();
void Sector_Erase(unsigned long Dst);
void Block_Erase_32K(unsigned long Dst);
void Block_Erase_64K(unsigned long Dst);
void Wait_Busy();
void Wait_Busy_AAI();
void WREN_Check();
void WREN_AAI_Check();


unsigned char upper_128[128];	/* global array to store read data */
					

