yicheng55/MSP430F55xx_uscib1_spi/MX25R1035Fdriver.c
/************************************************************************/
/* PROCEDURE: init							*/
/*									*/
/* This procedure initializes the SCK to low. Must be called prior to 	*/
/* setting up mode 0.							*/
/*									*/
/* Input:								*/
/*		None							*/
/*									*/
/* Output:								*/
/*		SCK							*/
/************************************************************************/
void init()
{
	P4SEL |= SOMI + SIMO + SCLK; 	// P4.2,1,3 use special function
	P4DIR |= CE; 					//Set P4.0 Gpio as chip enable
	P4OUT |= CE;

	UCB1CTL1 |= UCSWRST; // **Put state machine in reset**
	/*
	Bit 7: Clock phase select
	Clear UCCKPH...data is changed on first UCLK edge and captured on following
	Bit 6: Clock polarity select
	Clear UCCKPL...inactive state is low
	Bit 5: Direction of recieve and transmt shift register
	Set UCMSB...MSB first
	Bit 4: Character Length
	Clear UC7BIT...8-bit data
	Bit 3: Master mode select
	Set UCMST...Master mode (msp430 provides clock)
	Bit 2-1: 4-pin SPI with CE (UCxSTE active low) (slave enabled when UCxSTE=0)
	UCMODEx=00 or set UCMODE_0
	Bit 0: Synchronous mode enable
	Set UCSYNC Bit...Synchronous mode
	*/
	//UCB1CTL0 &= ~(UCCKPH + UCCKPL + UC7BIT);
	//UCB1CTL0 |= UCMSB + UCMST + UCMODE_0 + UCSYNC;

	UCB1CTL0 |= UCMST+UCSYNC+UCCKPL+UCMSB;    // 3-pin, 8-bit SPI master

	UCB1CTL1 |= UCSSEL_2; // SMCLK
	UCB1BR0 = 0x02; // /2
	UCB1BR1 = 0; //

	UCB1CTL1 &= ~UCSWRST; // **Initialize USCI state machine**
	//UCB1IE |= UCRXIE; // Enable USCI_B1 RX interrupt
}



void SST_Init(void)
{
	int i;
	init();
	  for(i=50;i>0;i--);                        // Wait for slave to initialize
	/*
	WREN();
	EWSR();
	WRSR(0x02,0);
	DBSY();
	*/
}


/************************************************************************/
/* PROCEDURE: Send_Byte							*/
/*									*/
/* This procedure outputs a byte shifting out 1-bit per clock rising	*/
/* edge on the the SI pin(LSB 1st).					*/
/*									*/
/* Input:								*/
/*		out							*/
/*									*/
/* Output:								*/
/*		SI							*/
/************************************************************************/
void Send_Byte(unsigned char out)
{
	  while (!(UCB1IFG & UCTXIFG)); 	// USCI_B1 TX buffer ready?
	  UCB1TXBUF = out; 					// Transmit message

      while (!(UCB1IFG & UCRXIFG)); 	// wait until something receives. This also means that sending is completed
	  UCB1IFG &= ~ UCRXIFG; 			//clear flag

}


unsigned char Send_Byte1(unsigned char out)
{
	  while (!(UCB1IFG & UCTXIFG)); 	// USCI_B1 TX buffer ready?
	  UCB1TXBUF = out; 					// Transmit message

      while (!(UCB1IFG & UCRXIFG)); 	// wait until something receives. This also means that sending is completed
	  UCB1IFG &= ~ UCRXIFG; 			//clear flag
	  return UCB1RXBUF;
}

/************************************************************************/
/* PROCEDURE: Get_Byte							*/
/*									*/
/* This procedure inputs a byte shifting in 1-bit per clock falling	*/
/* edge on the SO pin(LSB 1st).						*/
/*									*/
/* Input:								*/
/*		SO							*/
/*									*/
/* Output:								*/
/*		None							*/
/************************************************************************/
unsigned char Get_Byte()
{
	Send_Byte(0xFF);				//clear buffer

	return UCB1RXBUF;
}

/************************************************************************/
/* PROCEDURE: Poll_SO							*/
/*									*/
/* This procedure polls for the SO line during AAI programming  	*/
/* waiting for SO to transition to 1 which will indicate AAI programming*/
/* is completed								*/
/*									*/
/* Input:								*/
/*		SO							*/
/*									*/
/* Output:								*/
/*		None							*/
/************************************************************************/
void Poll_SO()
{

	//unsigned char temp = 0;
	//CE_Low();
    //   	while (temp == 0x00)	/* waste time until not busy */
	//	temp = SO;
	//CE_High();
	while(Read_Status_Register() & 0x01);	//stuck in this function while the flash is busy
}

/************************************************************************/
/* PROCEDURE: CE_High							*/
/*									*/
/* This procedure set CE = High.					*/
/* disable chip through	*/
/*									*/
/* Input:								*/
/*		None							*/
/*									*/
/* Output:								*/
/*		CE							*/
/*									*/
/************************************************************************/
void CE_High() 			//disable chip through
{
	//CE = 1;				/* set CE high */
	P4OUT &= ~CE;
	P4OUT |= CE;
}

/************************************************************************/
/* PROCEDURE: CE_Low							*/
/*									*/
/* This procedure drives the CE of the device to low.  			*/
/* enable chip through SS line   */
/*									*/
/* Input:								*/
/*		None							*/
/*									*/
/* Output:								*/
/*		CE							*/
/*									*/
/************************************************************************/
void CE_Low() 			//enable chip through
{	
	//CE = 0;				/* clear CE low */
	P4OUT |= CE;
	P4OUT &= ~CE;
}

/************************************************************************/
/* PROCEDURE: Hold()							*/
/*									*/
/* This procedure clears the Hold pin to low.				*/
/*									*/
/* Input:								*/
/*		None							*/
/*									*/
/* Output:								*/
/*		Hold							*/
/************************************************************************/
void Hold_Low()
{
	//Hold = 0;			/* clear Hold pin */
}

/************************************************************************/
/* PROCEDURE: Unhold()							*/
/*									*/
/* This procedure sets the Hold pin to high.				*/
/*									*/
/* Input:								*/
/*		None							*/
/*									*/
/* Output:								*/
/*		Hold							*/
/************************************************************************/
void Unhold()
{
	//Hold = 1;			/* set Hold pin */
}

/************************************************************************/
/* PROCEDURE: WP()							*/
/*									*/
/* This procedure clears the WP pin to low.				*/
/*									*/
/* Input:								*/
/*		None							*/
/*									*/
/* Output:								*/
/*		WP							*/
/************************************************************************/
void WP_Low()
{
	//WP = 0;				/* clear WP pin */
}

